Repository: tisfeng/Easydict
Catalog: Easydict/App/Localizable.xcstrings
Source language: en
Languages: ar, bg, bn, ca, cs, da, de, el, es, et, fa, fi, fil, fr, he, hi, hr, hu, id, it, ja, ka, km, ko, lo, lt, lv, mn_mong, ms, my, nb, nl, pl, pt, pt_br, ro, ru, sk, sl, sr_cyrl, sv, ta, te, th, tr, ug, uk, ur, vi, zh_hans, zh_hant

# grammar_analysis_service
source: Grammar Analysis
ar: تحليل القواعد
bg: Граматичен анализ
bn: ব্যাকরণ বিশ্লেষণ
ca: Anàlisi gramatical
cs: Gramatická analýza
da: Grammatikanalyse
de: Grammatikanalyse
el: Γραμματική ανάλυση
es: Análisis gramatical
et: Grammatika analüüs
fa: تحلیل دستور زبان
fi: Kielioppianalyysi
fil: Pagsusuri ng gramatika
fr: Analyse grammaticale
he: ניתוח דקדוקי
hi: व्याकरण विश्लेषण
hr: Gramatička analiza
hu: Nyelvtani elemzés
id: Analisis tata bahasa
it: Analisi grammaticale
ja: 文法解析
ka: გრამატიკული ანალიზი
km: ការវិភាគវេយ្យាករណ៍
ko: 문법 분석
lo: ການວິເຄາະໄວຍາກອນ
lt: Gramatikos analizė
lv: Gramatikas analīze
mn_mong: Дүрмийн шинжилгээ
ms: Analisis tatabahasa
my: သဒ္ဒါခွဲခြမ်းစိတ်ဖြာမှု
nb: Grammatikkanalyse
nl: Grammatica-analyse
pl: Analiza gramatyczna
pt: Análise gramatical
pt_br: Análise gramatical
ro: Analiză gramaticală
ru: Грамматический анализ
sk: Gramatická analýza
sl: Slovnična analiza
sr_cyrl: Граматичка анализа
sv: Grammatikanalys
ta: இலக்கண பகுப்பாய்வு
te: వ్యాకరణ విశ్లేషణ
th: การวิเคราะห์ไวยากรณ์
tr: Dil bilgisi analizi
ug: گرامماتىكا تەھلىلى
uk: Граматичний аналіз
ur: گرامر تجزیہ
vi: Phân tích ngữ pháp
zh_hans: 语法分析
zh_hant: 語法分析

# grammar.analysis.credential_source.built_in.title
source: Built-in Key
ar: المفتاح المدمج
bg: Вграден ключ
bn: অন্তর্নির্মিত Key
ca: Clau integrada
cs: Vestavěný klíč
da: Indbygget nøgle
de: Integrierter Schlüssel
el: Ενσωματωμένο κλειδί
es: Clave integrada
et: Sisseehitatud võti
fa: کلید داخلی
fi: Sisäänrakennettu avain
fil: Nakapaloob na Key
fr: Clé intégrée
he: מפתח מובנה
hi: अंतर्निहित Key
hr: Ugrađeni ključ
hu: Beépített kulcs
id: Key bawaan
it: Chiave integrata
ja: 内蔵キー
ka: ჩაშენებული გასაღები
km: Key ក្នុងកម្មវិធី
ko: 내장 Key
lo: Key ໃນຕົວ
lt: Vidinis raktas
lv: Iebūvēta atslēga
mn_mong: Суурилуулсан түлхүүр
ms: Key terbina dalam
my: အတွင်းပါ Key
nb: Innebygd nøkkel
nl: Ingebouwde sleutel
pl: Wbudowany klucz
pt: Chave integrada
pt_br: Chave integrada
ro: Cheie încorporată
ru: Встроенный ключ
sk: Vstavaný kľúč
sl: Vgrajeni ključ
sr_cyrl: Уграђени кључ
sv: Inbyggd nyckel
ta: உள்ளமைக்கப்பட்ட Key
te: అంతర్నిర్మిత Key
th: คีย์ในตัว
tr: Yerleşik anahtar
ug: ئىچكى ئاچقۇچ
uk: Вбудований ключ
ur: بلٹ اِن Key
vi: Khóa tích hợp
zh_hans: 内置 Key
zh_hant: 內建 Key

# grammar.analysis.credential_source.openai_key.footnote
source: Fill in your own OpenAI API key. The endpoint supports the recommended official address and can still be edited manually.
ar: أدخل مفتاح OpenAI API الخاص بك. يدعم Endpoint العنوان الرسمي الموصى به، وما زال بإمكانك تعديله يدويًا.
bg: Въведете свой собствен OpenAI API ключ. Endpoint поддържа препоръчания официален адрес и все още може да се редактира ръчно.
bn: আপনার নিজস্ব OpenAI API key দিন। Endpoint-এ প্রস্তাবিত অফিসিয়াল ঠিকানা ব্যবহার করা যায়, তবে আপনি চাইলে হাতে বদলাতেও পারবেন।
ca: Introdueix la teva pròpia clau API d’OpenAI. L’endpoint admet l’adreça oficial recomanada i encara es pot editar manualment.
cs: Vyplňte svůj vlastní OpenAI API klíč. Endpoint podporuje doporučenou oficiální adresu a stále ho můžete ručně upravit.
da: Indtast din egen OpenAI API-nøgle. Endpoint understøtter den anbefalede officielle adresse og kan stadig redigeres manuelt.
de: Geben Sie Ihren eigenen OpenAI-API-Schlüssel ein. Der Endpoint unterstützt die empfohlene offizielle Adresse und kann weiterhin manuell bearbeitet werden.
el: Συμπληρώστε το δικό σας κλειδί OpenAI API. Το Endpoint υποστηρίζει τη συνιστώμενη επίσημη διεύθυνση και μπορεί ακόμη να τροποποιηθεί χειροκίνητα.
es: Solo tienes que rellenar tu propia clave de OpenAI. El endpoint admite la dirección oficial recomendada y aún puedes editarlo manualmente.
et: Sisestage oma OpenAI API võti. Endpoint toetab soovitatud ametlikku aadressi ja seda saab endiselt käsitsi muuta.
fa: کلید API اوپن‌اِی‌آی خود را وارد کنید. Endpoint از نشانی رسمیِ پیشنهادی پشتیبانی می‌کند و همچنان می‌توانید آن را دستی ویرایش کنید.
fi: Täytä oma OpenAI API -avaimesi. Endpoint tukee suositeltua virallista osoitetta ja sitä voi silti muokata käsin.
fil: Ilagay ang sarili mong OpenAI API key. Sinusuportahan ng Endpoint ang inirerekomendang opisyal na address at maaari mo pa rin itong manu-manong baguhin.
fr: Renseignez votre propre clé API OpenAI. L’endpoint prend en charge l’adresse officielle recommandée et peut toujours être modifié manuellement.
he: מלא את מפתח ה-API האישי שלך של OpenAI. ה-Endpoint תומך בכתובת הרשמית המומלצת ועדיין ניתן לערוך אותו ידנית.
hi: अपना OpenAI API key भरें। Endpoint अनुशंसित आधिकारिक पते का समर्थन करता है, और आप इसे अभी भी हाथ से बदल सकते हैं।
hr: Unesite vlastiti OpenAI API ključ. Endpoint podržava preporučenu službenu adresu i još ga uvijek možete ručno urediti.
hu: Adja meg saját OpenAI API-kulcsát. Az Endpoint támogatja az ajánlott hivatalos címet, és továbbra is kézzel szerkeszthető.
id: Isi OpenAI API key milik Anda sendiri. Endpoint mendukung alamat resmi yang direkomendasikan dan tetap bisa diedit secara manual.
it: Inserisci la tua chiave API OpenAI. L’endpoint supporta l’indirizzo ufficiale consigliato e può ancora essere modificato manualmente.
ja: 独自の OpenAI API キーを入力してください。エンドポイントには推奨の公式アドレスを使えますが、手動で編集することもできます。
ka: შეიყვანეთ თქვენი OpenAI API key. Endpoint მხარს უჭერს რეკომენდებულ ოფიციალურ მისამართს და მისი ხელით შეცვლაც კვლავ შესაძლებელია.
km: បំពេញ OpenAI API key ផ្ទាល់ខ្លួនរបស់អ្នក។ Endpoint គាំទ្រអាសយដ្ឋានផ្លូវការដែលបានណែនាំ ហើយអ្នកនៅតែអាចកែដោយដៃបាន។
ko: 자신의 OpenAI API Key를 입력하세요. Endpoint는 권장 공식 주소를 지원하며, 필요하면 수동으로 수정할 수도 있습니다.
lo: ກອກ OpenAI API key ຂອງທ່ານເອງ. Endpoint ຮອງຮັບທີ່ຢູ່ທາງການທີ່ແນະນຳ ແລະທ່ານຍັງສາມາດແກ້ໄຂດ້ວຍມືໄດ້.
lt: Įveskite savo OpenAI API raktą. Endpoint palaiko rekomenduojamą oficialų adresą ir vis dar gali būti redaguojamas rankiniu būdu.
lv: Ievadiet savu OpenAI API atslēgu. Endpoint atbalsta ieteikto oficiālo adresi un to joprojām var rediģēt manuāli.
mn_mong: Өөрийн OpenAI API түлхүүрээ оруулна уу. Endpoint нь санал болгосон албан ёсны хаягийг дэмждэг бөгөөд та үүнийг гараар засварлаж болно.
ms: Isi OpenAI API key anda sendiri. Endpoint menyokong alamat rasmi yang disyorkan dan masih boleh diedit secara manual.
my: သင်၏ OpenAI API key ကို ဖြည့်ပါ။ Endpoint သည် အကြံပြုထားသော တရားဝင်လိပ်စာကို ပံ့ပိုးပေးပြီး လက်ဖြင့်လည်း ပြင်ဆင်နိုင်ပါသေးသည်။
nb: Fyll inn din egen OpenAI API-nøkkel. Endpoint støtter den anbefalte offisielle adressen og kan fortsatt redigeres manuelt.
nl: Vul je eigen OpenAI API-sleutel in. De Endpoint ondersteunt het aanbevolen officiële adres en kan nog steeds handmatig worden aangepast.
pl: Wpisz własny klucz OpenAI API. Endpoint obsługuje zalecany oficjalny adres i nadal można go edytować ręcznie.
pt: Preencha a sua própria chave da API OpenAI. O Endpoint suporta o endereço oficial recomendado e ainda pode ser editado manualmente.
pt_br: Preencha sua própria chave da API OpenAI. O Endpoint suporta o endereço oficial recomendado e ainda pode ser editado manualmente.
ro: Introduce cheia ta OpenAI API. Endpoint acceptă adresa oficială recomandată și poate fi editat manual în continuare.
ru: Введите свой OpenAI API key. Endpoint поддерживает рекомендуемый официальный адрес, и его по-прежнему можно изменить вручную.
sk: Vyplňte vlastný OpenAI API kľúč. Endpoint podporuje odporúčanú oficiálnu adresu a stále ho môžete ručne upraviť.
sl: Vnesite svoj OpenAI API ključ. Endpoint podpira priporočeni uradni naslov in ga je še vedno mogoče ročno urediti.
sr_cyrl: Унесите свој OpenAI API кључ. Endpoint подржава препоручену званичну адресу и и даље се може ручно уредити.
sv: Fyll i din egen OpenAI API-nyckel. Endpoint stöder den rekommenderade officiella adressen och kan fortfarande redigeras manuellt.
ta: உங்கள் சொந்த OpenAI API Key-ஐ நிரப்புங்கள். Endpoint பரிந்துரைக்கப்பட்ட அதிகாரப்பூர்வ முகவரியை ஆதரிக்கிறது; வேண்டுமெனில் அதை கைமுறையாக மாற்றலாம்.
te: మీ స్వంత OpenAI API Key‌ను పూరించండి. Endpoint సిఫార్సు చేసిన అధికారిక చిరునామాను మద్దతు ఇస్తుంది, అవసరమైతే మీరు దాన్ని చేతితో మార్చవచ్చు.
th: กรอก OpenAI API Key ของคุณเองได้เลย Endpoint รองรับที่อยู่ทางการที่แนะนำ และคุณยังแก้ไขเองได้เช่นกัน
tr: Kendi OpenAI API anahtarınızı girin. Endpoint önerilen resmî adresi destekler ve hâlâ elle düzenlenebilir.
ug: ئۆزىڭىزنىڭ OpenAI API key نى تولدۇرۇڭ. Endpoint تەۋسىيە قىلىنغان رەسمىي ئادرېسنى قوللايدۇ، يەنىلا قولدا ئۆزگەرتەلەيسىز.
uk: Введіть власний OpenAI API key. Endpoint підтримує рекомендовану офіційну адресу, і його все ще можна редагувати вручну.
ur: اپنی OpenAI API key درج کریں۔ Endpoint تجویز کردہ سرکاری پتے کو سپورٹ کرتا ہے، اور آپ اسے اب بھی دستی طور پر تبدیل کر سکتے ہیں۔
vi: Hãy điền OpenAI API key của riêng bạn. Endpoint hỗ trợ địa chỉ chính thức được đề xuất và bạn vẫn có thể chỉnh sửa thủ công.
zh_hans: 填写你自己的 OpenAI Key 即可。Endpoint 支持使用推荐的官方地址，你也仍然可以手动修改。
zh_hant: 填寫你自己的 OpenAI Key 即可。Endpoint 支援使用推薦的官方位址，你也仍可手動修改。

# grammar.analysis.credential_source.title
source: Key Source
ar: مصدر المفتاح
bg: Източник на ключа
bn: Key উৎস
ca: Origen de la clau
cs: Zdroj klíče
da: Nøglekilde
de: Schlüsselquelle
el: Πηγή κλειδιού
es: Origen de credenciales
et: Võtme allikas
fa: منبع کلید
fi: Avaimen lähde
fil: Pinagmulan ng Key
fr: Source de la clé
he: מקור המפתח
hi: Key स्रोत
hr: Izvor ključa
hu: Kulcsforrás
id: Sumber Key
it: Origine della chiave
ja: 認証情報のソース
ka: გასაღების წყარო
km: ប្រភព Key
ko: Key 출처
lo: ແຫຼ່ງຂອງ Key
lt: Rakto šaltinis
lv: Atslēgas avots
mn_mong: Түлхүүрийн эх сурвалж
ms: Sumber Key
my: Key အရင်းအမြစ်
nb: Nøkkelkilde
nl: Sleutelbron
pl: Źródło klucza
pt: Origem da chave
pt_br: Origem da chave
ro: Sursa cheii
ru: Источник ключа
sk: Zdroj poverení
sl: Vir ključa
sr_cyrl: Извор кључа
sv: Nyckelkälla
ta: Key மூலம்
te: Key మూలం
th: แหล่งที่มาของคีย์
tr: Anahtar kaynağı
ug: Key مەنبەسى
uk: Джерело ключа
ur: Key ماخذ
vi: Nguồn Key
zh_hans: Key 来源
zh_hant: Key 來源

# grammar.analysis.missing_model
source: Please fetch or fill in Supported Models first, then choose one model.
ar: يُرجى أولاً جلب Supported Models أو تعبئتها، ثم اختيار نموذج واحد.
bg: Моля, първо извлечете или попълнете Supported Models и след това изберете един модел.
bn: দয়া করে আগে Supported Models টেনে আনুন বা পূরণ করুন, তারপর একটি মডেল বেছে নিন।
ca: Primer recupera o omple Supported Models i després tria un model.
cs: Nejprve načtěte nebo vyplňte Supported Models a potom vyberte jeden model.
da: Hent eller udfyld først Supported Models, og vælg derefter én model.
de: Bitte rufen Sie zuerst Supported Models ab oder tragen Sie sie ein und wählen Sie dann ein Modell aus.
el: Ανακτήστε ή συμπληρώστε πρώτα τα Supported Models και έπειτα επιλέξτε ένα μοντέλο.
es: Primero obtén o rellena Modelos compatibles y luego elige un modelo.
et: Too esmalt Supported Models või täitke see ja seejärel valige üks mudel.
fa: لطفاً ابتدا Supported Models را دریافت یا تکمیل کنید و سپس یک مدل را انتخاب کنید.
fi: Hae tai täytä ensin Supported Models ja valitse sitten yksi malli.
fil: Pakikuha o punan muna ang Supported Models, pagkatapos ay pumili ng isang modelo.
fr: Récupérez ou renseignez d’abord les Supported Models, puis choisissez un modèle.
he: יש למשוך או למלא תחילה את Supported Models ולאחר מכן לבחור מודל אחד.
hi: कृपया पहले Supported Models प्राप्त करें या भरें, फिर एक मॉडल चुनें।
hr: Najprije dohvatite ili ispunite Supported Models, a zatim odaberite jedan model.
hu: Először töltse le vagy adja meg a Supported Models értékeit, majd válasszon egy modellt.
id: Silakan ambil atau isi Supported Models terlebih dahulu, lalu pilih satu model.
it: Recupera o compila prima Supported Models, poi scegli un modello.
ja: 先に対応モデルを取得または入力してから、使用モデルを選択してください。
ka: ჯერ მოითხოვეთ ან შეავსეთ Supported Models, შემდეგ კი აირჩიეთ ერთი მოდელი.
km: សូមទាញយក ឬបំពេញ Supported Models ជាមុនសិន បន្ទាប់មកជ្រើសរើសម៉ូដែលមួយ។
ko: 먼저 Supported Models를 가져오거나 입력한 뒤 사용할 모델 하나를 선택하세요.
lo: ກະລຸນາດຶງຫຼືກອກ Supported Models ກ່ອນ ແລ້ວຈຶ່ງເລືອກໂມເດວໜຶ່ງ.
lt: Pirmiausia nuskaitykite arba užpildykite Supported Models, tada pasirinkite vieną modelį.
lv: Vispirms iegūstiet vai aizpildiet Supported Models un pēc tam izvēlieties vienu modeli.
mn_mong: Эхлээд Supported Models-ийг татаж авах эсвэл бөглөж, дараа нь нэг загвар сонгоно уу.
ms: Sila ambil atau isi Supported Models terlebih dahulu, kemudian pilih satu model.
my: ကျေးဇူးပြု၍ Supported Models ကို အရင်ရယူပါ သို့မဟုတ် ဖြည့်ပါ၊ ထို့နောက် မော်ဒယ်တစ်ခုကို ရွေးပါ။
nb: Hent eller fyll inn Supported Models først, og velg deretter én modell.
nl: Haal eerst Supported Models op of vul ze in en kies daarna één model.
pl: Najpierw pobierz lub uzupełnij Supported Models, a następnie wybierz jeden model.
pt: Primeiro obtenha ou preencha Supported Models e depois escolha um modelo.
pt_br: Primeiro busque ou preencha Supported Models e depois escolha um modelo.
ro: Mai întâi preia sau completează Supported Models, apoi alege un model.
ru: Сначала получите или заполните Supported Models, а затем выберите одну модель.
sk: Najprv načítajte alebo zadajte podporované modely a potom vyberte jeden model.
sl: Najprej pridobite ali izpolnite Supported Models, nato izberite en model.
sr_cyrl: Прво преузмите или попуните Supported Models, па затим изаберите један модел.
sv: Hämta eller fyll först i Supported Models och välj sedan en modell.
ta: முதலில் Supported Models-ஐ பெறுங்கள் அல்லது நிரப்புங்கள், பின்னர் ஒரு மாடலைத் தேர்ந்தெடுக்கவும்.
te: దయచేసి ముందుగా Supported Models‌ను పొందండి లేదా పూరించండి, ఆ తర్వాత ఒక మోడల్‌ను ఎంచుకోండి.
th: โปรดดึงหรือกรอก Supported Models ก่อน แล้วค่อยเลือกโมเดลหนึ่งรายการ
tr: Lütfen önce Supported Models listesini alın veya doldurun, ardından bir model seçin.
ug: ئاۋۋال Supported Models نى تارتىۋېلىڭ ياكى تولدۇرۇڭ، ئاندىن بىر مودېل تاللاڭ.
uk: Спочатку отримайте або заповніть Supported Models, а потім виберіть одну модель.
ur: براہِ کرم پہلے Supported Models حاصل کریں یا بھریں، پھر ایک ماڈل منتخب کریں۔
vi: Vui lòng tải hoặc điền Supported Models trước, sau đó chọn một model.
zh_hans: 请先拉取或填写 Supported Models，再选择一个使用模型。
zh_hant: 請先擷取或填寫 Supported Models，再選擇一個使用模型。

# grammar.analysis.mode.general.title
source: General
ar: عام
bg: Общ
bn: সাধারণ
cs: Obecný
da: Generel
de: Allgemein
el: Γενικό
et: Üldine
fa: عمومی
fi: Yleinen
fil: Pangkalahatan
fr: Général
he: כללי
hi: सामान्य
hr: Općenito
hu: Általános
id: Umum
it: Generale
ja: 通常
ka: ზოგადი
km: ទូទៅ
ko: 일반
lo: ທົ່ວໄປ
lt: Bendras
lv: Vispārīgs
mn_mong: Ерөнхий
ms: Umum
my: အထွေထွေ
nb: Generell
nl: Algemeen
pl: Ogólny
pt: Geral
pt_br: Geral
ru: Общий
sk: Bežná
sl: Splošno
sr_cyrl: Опште
sv: Allmänt
ta: பொது
te: సాధారణ
th: ทั่วไป
tr: Genel
ug: ئادەتتىكى
uk: Загальний
ur: عام
vi: Chung
zh_hans: 常规
zh_hant: 常規

# grammar.analysis.mode.title
source: Mode
ar: الوضع
bg: Режим
bn: মোড
cs: Režim
da: Tilstand
de: Modus
el: Λειτουργία
es: Modo
et: Režiim
fa: حالت
fi: Tila
he: מצב
hi: मोड
hr: Način
hu: Mód
it: Modalità
ja: モード
ka: რეჟიმი
km: របៀប
ko: 모드
lo: ໂໝດ
lt: Režimas
lv: Režīms
mn_mong: Горим
ms: Mod
my: မုဒ်
nb: Modus
nl: Modus
pl: Tryb
pt: Modo
pt_br: Modo
ro: Mod
ru: Режим
sk: Režim
sl: Način
sr_cyrl: Режим
sv: Läge
ta: பயன்முறை
te: మోడ్
th: โหมด
tr: Mod
ug: ھالەت
uk: Режим
ur: موڈ
vi: Chế độ
zh_hans: 模式
zh_hant: 模式

# grammar.analysis.provider.custom_compatible.footnote
source: Use any OpenAI-compatible chat/completions endpoint. Fill in the endpoint and models yourself, or fetch models if the provider supports it.
ar: استخدم أي Endpoint متوافق مع OpenAI من نوع `chat/completions`. املأ الـ Endpoint والنماذج بنفسك، أو استخدم Fetch Models إذا كان المزوّد يدعم ذلك.
bg: Използвайте всеки OpenAI-съвместим `chat/completions` Endpoint. Попълнете сами Endpoint и моделите или използвайте Fetch Models, ако доставчикът го поддържа.
bn: যেকোনো OpenAI-compatible `chat/completions` Endpoint ব্যবহার করুন। Endpoint আর model নিজে পূরণ করুন, অথবা provider সমর্থন করলে Fetch Models ব্যবহার করুন।
ca: Utilitza qualsevol Endpoint `chat/completions` compatible amb OpenAI. Omple tu mateix l’Endpoint i els models, o bé usa Fetch Models si el proveïdor ho admet.
cs: Použijte libovolný OpenAI-kompatibilní `chat/completions` Endpoint. Endpoint a modely vyplňte sami, případně použijte Fetch Models, pokud to poskytovatel podporuje.
da: Brug et vilkårligt OpenAI-kompatibelt `chat/completions` Endpoint. Udfyld selv Endpoint og modeller, eller brug Fetch Models, hvis udbyderen understøtter det.
de: Verwenden Sie einen beliebigen OpenAI-kompatiblen `chat/completions`-Endpoint. Tragen Sie Endpoint und Modelle selbst ein oder verwenden Sie Fetch Models, wenn der Anbieter dies unterstützt.
el: Χρησιμοποιήστε οποιοδήποτε συμβατό με OpenAI `chat/completions` Endpoint. Συμπληρώστε μόνοι σας το Endpoint και τα μοντέλα ή χρησιμοποιήστε το Fetch Models, αν το υποστηρίζει ο πάροχος.
es: Usa cualquier endpoint `chat/completions` compatible con OpenAI. Rellena el endpoint y los modelos manualmente, o recupéralos si el proveedor lo permite.
et: Kasutage mis tahes OpenAI-ga ühilduvat `chat/completions` Endpointi. Täitke Endpoint ja mudelid ise või kasutage Fetch Models funktsiooni, kui teenusepakkuja seda toetab.
fa: از هر Endpoint سازگار با OpenAI از نوع `chat/completions` استفاده کنید. Endpoint و مدل‌ها را خودتان وارد کنید، یا اگر ارائه‌دهنده پشتیبانی می‌کند از Fetch Models استفاده کنید.
fi: Käytä mitä tahansa OpenAI-yhteensopivaa `chat/completions` Endpointia. Täytä Endpoint ja mallit itse tai käytä Fetch Models -toimintoa, jos palveluntarjoaja tukee sitä.
fil: Gumamit ng anumang OpenAI-compatible na `chat/completions` Endpoint. Ikaw mismo ang maglagay ng Endpoint at mga modelo, o gumamit ng Fetch Models kung sinusuportahan ito ng provider.
fr: Utilisez n’importe quel endpoint `chat/completions` compatible OpenAI. Renseignez vous-même l’endpoint et les modèles, ou utilisez Fetch Models si le fournisseur le prend en charge.
he: השתמש בכל Endpoint תואם OpenAI מסוג `chat/completions`. מלא בעצמך את ה-Endpoint ואת המודלים, או השתמש ב-Fetch Models אם הספק תומך בכך.
hi: किसी भी OpenAI-compatible `chat/completions` Endpoint का उपयोग करें। Endpoint और models खुद भरें, या अगर provider सपोर्ट करता हो तो Fetch Models इस्तेमाल करें।
hr: Koristite bilo koji OpenAI-kompatibilan `chat/completions` Endpoint. Endpoint i modele unesite sami ili upotrijebite Fetch Models ako to pružatelj podržava.
hu: Bármilyen OpenAI-kompatibilis `chat/completions` Endpoint használható. Az Endpointot és a modelleket adja meg kézzel, vagy használja a Fetch Models lehetőséget, ha a szolgáltató támogatja.
id: Gunakan Endpoint `chat/completions` apa pun yang kompatibel dengan OpenAI. Isi sendiri Endpoint dan modelnya, atau gunakan Fetch Models jika penyedia mendukungnya.
it: Usa qualsiasi Endpoint `chat/completions` compatibile con OpenAI. Compila manualmente Endpoint e modelli oppure usa Fetch Models se il provider lo supporta.
ja: 任意の OpenAI 互換 chat/completions エンドポイントを使用します。エンドポイントとモデルは自分で入力するか、対応していればモデル取得を使ってください。
ka: გამოიყენეთ ნებისმიერი OpenAI-თავსებადი `chat/completions` Endpoint. Endpoint და მოდელები თავად შეავსეთ, ან გამოიყენეთ Fetch Models, თუ provider ამას მხარს უჭერს.
km: ប្រើ Endpoint `chat/completions` ណាមួយដែលឆបគ្នានឹង OpenAI។ សូមបំពេញ Endpoint និងម៉ូដែលដោយខ្លួនឯង ឬប្រើ Fetch Models ប្រសិនបើអ្នកផ្ដល់សេវាគាំទ្រ។
ko: OpenAI 호환 `chat/completions` Endpoint라면 무엇이든 사용할 수 있습니다. Endpoint와 모델은 직접 입력하거나, 제공자가 지원하면 Fetch Models를 사용하세요.
lo: ໃຊ້ Endpoint `chat/completions` ທີ່ເຂົ້າກັນໄດ້ກັບ OpenAI ໃດກໍໄດ້. ກອກ Endpoint ແລະໂມເດວດ້ວຍຕົນເອງ ຫຼືໃຊ້ Fetch Models ຖ້າ provider ຮອງຮັບ.
lt: Naudokite bet kurį su OpenAI suderinamą `chat/completions` Endpoint. Endpoint ir modelius užpildykite patys arba naudokite Fetch Models, jei teikėjas tai palaiko.
lv: Izmantojiet jebkuru ar OpenAI saderīgu `chat/completions` Endpoint. Ievadiet Endpoint un modeļus paši vai izmantojiet Fetch Models, ja pakalpojumu sniedzējs to atbalsta.
mn_mong: OpenAI-тэй нийцтэй дурын `chat/completions` Endpoint ашиглана уу. Endpoint болон загваруудыг өөрөө бөглөх эсвэл нийлүүлэгч дэмждэг бол Fetch Models ашиглана уу.
ms: Gunakan mana-mana Endpoint `chat/completions` yang serasi dengan OpenAI. Isi Endpoint dan model sendiri, atau gunakan Fetch Models jika penyedia menyokongnya.
my: OpenAI နှင့် ကိုက်ညီသော `chat/completions` Endpoint မည်သည့်တစ်ခုကိုမဆို အသုံးပြုပါ။ Endpoint နှင့် model များကို ကိုယ်တိုင်ဖြည့်ပါ၊ သို့မဟုတ် provider က ပံ့ပိုးလျှင် Fetch Models ကို သုံးပါ။
nb: Bruk en hvilken som helst OpenAI-kompatibel `chat/completions` Endpoint. Fyll inn Endpoint og modeller selv, eller bruk Fetch Models hvis leverandøren støtter det.
nl: Gebruik een willekeurige OpenAI-compatibele `chat/completions` Endpoint. Vul de Endpoint en modellen zelf in, of gebruik Fetch Models als de provider dat ondersteunt.
pl: Użyj dowolnego zgodnego z OpenAI Endpointu `chat/completions`. Wpisz Endpoint i modele ręcznie albo użyj Fetch Models, jeśli dostawca to obsługuje.
pt: Use qualquer Endpoint `chat/completions` compatível com OpenAI. Preencha o Endpoint e os modelos manualmente ou use Fetch Models se o fornecedor oferecer suporte.
pt_br: Use qualquer Endpoint `chat/completions` compatível com OpenAI. Preencha o Endpoint e os modelos manualmente ou use Fetch Models se o provedor oferecer suporte.
ro: Folosește orice Endpoint `chat/completions` compatibil cu OpenAI. Completează manual Endpoint-ul și modelele sau folosește Fetch Models dacă furnizorul acceptă acest lucru.
ru: Используйте любой OpenAI-совместимый `chat/completions` Endpoint. Заполните Endpoint и модели вручную или используйте Fetch Models, если провайдер это поддерживает.
sk: Použite ľubovoľný OpenAI-kompatibilný endpoint chat/completions. Endpoint a modely zadajte ručne alebo ich načítajte, ak to poskytovateľ podporuje.
sl: Uporabite katerikoli z OpenAI združljiv `chat/completions` Endpoint. Endpoint in modele izpolnite sami ali uporabite Fetch Models, če to ponudnik podpira.
sr_cyrl: Користите било који OpenAI-компатибилан `chat/completions` Endpoint. Endpoint и моделе унесите ручно или употребите Fetch Models ако provider то подржава.
sv: Använd valfri OpenAI-kompatibel `chat/completions` Endpoint. Fyll i Endpoint och modeller själv, eller använd Fetch Models om leverantören stöder det.
ta: எந்த OpenAI-compatible `chat/completions` Endpoint-யையும் பயன்படுத்தலாம். Endpoint மற்றும் model-களை நீங்களே நிரப்புங்கள், அல்லது provider ஆதரித்தால் Fetch Models பயன்படுத்துங்கள்.
te: ఏదైనా OpenAI-compatible `chat/completions` Endpoint‌ను ఉపయోగించండి. Endpoint మరియు models‌ను మీరు స్వయంగా పూరించండి, లేదా provider మద్దతు ఇస్తే Fetch Models ఉపయోగించండి.
th: ใช้ Endpoint `chat/completions` ใดก็ได้ที่เข้ากันได้กับ OpenAI กรอก Endpoint และโมเดลด้วยตัวเอง หรือใช้ Fetch Models หากผู้ให้บริการรองรับ
tr: OpenAI uyumlu herhangi bir `chat/completions` Endpoint kullanın. Endpoint ve modelleri kendiniz doldurun veya sağlayıcı destekliyorsa Fetch Models kullanın.
ug: ھەر قانداق OpenAI ماس كېلىدىغان `chat/completions` Endpoint نى ئىشلىتىڭ. Endpoint ۋە مودېللەرنى ئۆزىڭىز تولدۇرۇڭ ياكى provider قوللىسا Fetch Models نى ئىشلىتىڭ.
uk: Використовуйте будь-який сумісний з OpenAI Endpoint `chat/completions`. Заповніть Endpoint і моделі вручну або використайте Fetch Models, якщо провайдер це підтримує.
ur: کسی بھی OpenAI-compatible `chat/completions` Endpoint کو استعمال کریں۔ Endpoint اور models خود بھریں، یا اگر provider سپورٹ کرتا ہو تو Fetch Models استعمال کریں۔
vi: Sử dụng bất kỳ Endpoint `chat/completions` nào tương thích với OpenAI. Tự điền Endpoint và các model, hoặc dùng Fetch Models nếu nhà cung cấp hỗ trợ.
zh_hans: 使用任意 OpenAI 兼容的 `chat/completions` 地址。Endpoint 和模型需要你自己填写，或在对方支持时通过 Fetch Models 拉取。
zh_hant: 使用任意 OpenAI 相容的 `chat/completions` 位址。Endpoint 與模型需要你自行填寫，或在對方支援時透過 Fetch Models 擷取。
